app/views/topics/index.html.erb


            <% if !topic.favorite_users.include?(current_user) %>
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2, 3, 4)

                <%= image_tag 'icons/heart-black.png', class: 'topic-index-icon'%>
                <%=  topic.favorites.count %>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`topic_id` = 3

                <%= image_tag 'icons/heart-black.png', class: 'topic-index-icon-loved'%>
                <%=  topic.favorites.count %>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`topic_id` = 1